turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16C_0.atdf
    <module caption="Cortex M Cache Controller" name="CMCC" version="11108C">
      <register-group name="CMCC">
        <register caption="Cache Type Register" name="CMCC_TYPE" offset="0x00" rw="R" size="4">
          <bitfield caption="Random Selection Policy Supported" mask="0x00000004" name="RANDP"/>
          <bitfield caption="Least Recently Used Policy Supported" mask="0x00000008" name="LRUP"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000010" name="RRP"/>
          <bitfield caption="Number of Way" mask="0x00000060" name="WAYNUM" values="CMCC_TYPE__WAYNUM"/>
          <bitfield caption="Lock Down Supported" mask="0x00000080" name="LCKDOWN"/>
          <bitfield caption="Cache Size" mask="0x00000700" name="CSIZE" values="CMCC_TYPE__CSIZE"/>
          <bitfield caption="Cache Size" mask="0x00003800" name="CLSIZE" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register caption="Cache Control Register" name="CMCC_CTRL" offset="0x08" rw="W" size="4">
          <bitfield caption="Cache Controller Enable" mask="0x00000001" name="CEN"/>
        </register>
        <register caption="Cache Status Register" name="CMCC_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Cache Controller Status" mask="0x00000001" name="CSTS"/>
        </register>
        <register caption="Cache Maintenance Register 0" name="CMCC_MAINT0" offset="0x20" rw="W" size="4">
          <bitfield caption="Cache Controller Invalidate All" mask="0x00000001" name="INVALL"/>
        </register>
        <register caption="Cache Maintenance Register 1" name="CMCC_MAINT1" offset="0x24" rw="W" size="4">
          <bitfield caption="Invalidate Index" mask="0x000001F0" name="INDEX"/>
          <bitfield caption="Invalidate Way" mask="0xC0000000" name="WAY" values="CMCC_MAINT1__WAY"/>
        </register>
        <register caption="Cache Monitor Configuration Register" name="CMCC_MCFG" offset="0x28" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Counter Mode" mask="0x00000003" name="MODE" values="CMCC_MCFG__MODE"/>
        </register>
        <register caption="Cache Monitor Enable Register" name="CMCC_MEN" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Enable" mask="0x00000001" name="MENABLE"/>
        </register>
        <register caption="Cache Monitor Control Register" name="CMCC_MCTRL" offset="0x30" rw="W" size="4">
          <bitfield caption="Monitor" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Cache Monitor Status Register" name="CMCC_MSR" offset="0x34" rw="R" size="4">
          <bitfield caption="Monitor Event Counter" mask="0xFFFFFFFF" name="EVENT_CNT"/>
        </register>
      </register-group>
      <value-group caption="" name="CMCC_TYPE__WAYNUM">
        <value caption="Direct Mapped Cache" name="DMAPPED" value="0x0"/>
        <value caption="2-WAY set associative" name="ARCH2WAY" value="0x1"/>
        <value caption="4-WAY set associative" name="ARCH4WAY" value="0x2"/>
        <value caption="8-WAY set associative" name="ARCH8WAY" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CSIZE">
        <value caption="Cache Size 1 Kbytes" name="CSIZE_1KB" value="0x0"/>
        <value caption="Cache Size 2 Kbytes" name="CSIZE_2KB" value="0x1"/>
        <value caption="Cache Size 4 Kbytes" name="CSIZE_4KB" value="0x2"/>
        <value caption="Cache Size 8 Kbytes" name="CSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CLSIZE">
        <value caption="4 Bytes" name="CLSIZE_1KB" value="0x0"/>
        <value caption="8 Bytes" name="CLSIZE_2KB" value="0x1"/>
        <value caption="16 Bytes" name="CLSIZE_4KB" value="0x2"/>
        <value caption="32 Bytes" name="CLSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MAINT1__WAY">
        <value caption="Way 0 is selection for index invalidation" name="WAY0" value="0x0"/>
        <value caption="Way 1 is selection for index invalidation" name="WAY1" value="0x1"/>
        <value caption="Way 2 is selection for index invalidation" name="WAY2" value="0x2"/>
        <value caption="Way 3 is selection for index invalidation" name="WAY3" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MCFG__MODE">
        <value caption="Cycle counter" name="CYCLE_COUNT" value="0x0"/>
        <value caption="Instruction hit counter" name="IHIT_COUNT" value="0x1"/>
        <value caption="Data hit counter" name="DHIT_COUNT" value="0x2"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450M">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
          <bitfield caption="Code Loop Optimization Enable" mask="0x04000000" name="CLOE"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
          <bitfield caption="Flash Error Status" mask="0x00000008" name="FLERR"/>
          <bitfield caption="Unique ECC Error on LSB Part of the Memory Flash Data Bus" mask="0x00010000" name="UECCELSB"/>
          <bitfield caption="Multiple ECC Error on LSB Part of the Memory Flash Data Bus" mask="0x00020000" name="MECCELSB"/>
          <bitfield caption="Unique ECC Error on MSB Part of the Memory Flash Data Bus" mask="0x00040000" name="UECCEMSB"/>
          <bitfield caption="Multiple ECC Error on MSB Part of the Memory Flash Data Bus" mask="0x00080000" name="MECCEMSB"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Erase pages" name="EPA" value="0x07"/>
        <value caption="Set lock bit" name="SLB" value="0x08"/>
        <value caption="Clear lock bit" name="CLB" value="0x09"/>
        <value caption="Get lock bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM bit" name="GGPB" value="0x0D"/>
        <value caption="Start read unique identifier" name="STUI" value="0x0E"/>
        <value caption="Stop read unique identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB bit" name="GCALB" value="0x10"/>
        <value caption="Erase sector" name="ES" value="0x11"/>
        <value caption="Write user signature" name="WUS" value="0x12"/>
        <value caption="Erase user signature" name="EUS" value="0x13"/>
        <value caption="Start read user signature" name="STUS" value="0x14"/>
        <value caption="Stop read user signature" name="SPUS" value="0x15"/>
      </value-group>
