turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16C_0.atdf
        <register caption="Fault Output Clear Register" name="PMC_FOCR" offset="0x0078" rw="W" size="4">
          <bitfield caption="Fault Output Clear" mask="0x00000001" name="FOCLR"/>
        </register>
        <register caption="Coprocessor Fast Start-up Mode Register" name="PMC_CPFSMR" offset="0x007C" rw="RW" size="4">
          <bitfield caption="Fast Start-up Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Start-up Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Start-up Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Start-up Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Start-up Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Start-up Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Start-up Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Start-up Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Start-up Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Start-up Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Start-up Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Start-up Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Start-up Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Start-up Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Start-up Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Start-up Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
        </register>
        <register caption="Write Protect Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY" values="PMC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Clock Enable Register 1" name="PMC_PCER1" offset="0x0100" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Enable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Enable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Enable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Enable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Enable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Enable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Enable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Enable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Enable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Enable" mask="0x00000800" name="PID43"/>
        </register>
        <register caption="Peripheral Clock Disable Register 1" name="PMC_PCDR1" offset="0x0104" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Disable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Disable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Disable" mask="0x00000800" name="PID43"/>
        </register>
        <register caption="Peripheral Clock Status Register 1" name="PMC_PCSR1" offset="0x0108" rw="R" size="4">
          <bitfield caption="Peripheral Clock 32 Status" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Status" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Status" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Status" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Status" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Status" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Status" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Status" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Status" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Status" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Status" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Status" mask="0x00000800" name="PID43"/>
        </register>
        <register caption="Oscillator Calibration Register" name="PMC_OCR" offset="0x0110" rw="RW" size="4">
          <bitfield caption="RC Oscillator Calibration bits for 4 MHz" mask="0x0000007F" name="CAL4"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 4 MHz" mask="0x00000080" name="SEL4"/>
          <bitfield caption="RC Oscillator Calibration bits for 8 MHz" mask="0x00007F00" name="CAL8"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 8 MHz" mask="0x00008000" name="SEL8"/>
          <bitfield caption="RC Oscillator Calibration bits for 12 MHz" mask="0x007F0000" name="CAL12"/>
          <bitfield caption="Selection of RC Oscillator Calibration bits for 12 MHz" mask="0x00800000" name="SEL12"/>
        </register>
        <register caption="PLL Maximum Multiplier Value Register" name="PMC_PMMR" offset="0x130" rw="RW" size="4"/>
      </register-group>
      <value-group caption="" name="PMC_SCER__CPKEY">
        <value caption="This field must be written to 0xA in order to validate CPCK field." name="PASSWD" value="0xA"/>
      </value-group>
      <value-group caption="" name="PMC_SCDR__CPKEY">
        <value caption="This field must be written to 0xA in order to validate CPCK field." name="PASSWD" value="0xA"/>
      </value-group>
