turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16C_0.atdf
        <register caption="Supply Controller Wake-up Mode Register" name="SUPC_WUMR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Force Wake-up Enable" mask="0x00000001" name="FWUPEN" values="SUPC_WUMR__FWUPEN"/>
          <bitfield caption="Supply Monitor Wake-up Enable" mask="0x00000002" name="SMEN" values="SUPC_WUMR__SMEN"/>
          <bitfield caption="Real-time Timer Wake-up Enable" mask="0x00000004" name="RTTEN" values="SUPC_WUMR__RTTEN"/>
          <bitfield caption="Real-time Clock Wake-up Enable" mask="0x00000008" name="RTCEN" values="SUPC_WUMR__RTCEN"/>
          <bitfield caption="Low-Power Debouncer Enable WKUP0/TMP0" mask="0x00000020" name="LPDBCEN0" values="SUPC_WUMR__LPDBCEN0"/>
          <bitfield caption="Low-Power Debouncer Enable WKUP10/TMP1" mask="0x00000040" name="LPDBCEN1" values="SUPC_WUMR__LPDBCEN1"/>
          <bitfield caption="Low-Power Debouncer Clear" mask="0x00000080" name="LPDBCCLR" values="SUPC_WUMR__LPDBCCLR"/>
          <bitfield caption="Force Wake-up Debouncer Period" mask="0x00000700" name="FWUPDBC" values="SUPC_WUMR__FWUPDBC"/>
          <bitfield caption="Wake-up Inputs Debouncer Period" mask="0x00007000" name="WKUPDBC" values="SUPC_WUMR__WKUPDBC"/>
          <bitfield caption="Low Power Debouncer Period" mask="0x00070000" name="LPDBC" values="SUPC_WUMR__LPDBC"/>
          <bitfield caption="Low Power Debouncer Enable WKUP14/TMP2" mask="0x00100000" name="LPDBCEN2" values="SUPC_WUMR__LPDBCEN2"/>
          <bitfield caption="Low Power Debouncer Enable WKUP15/TMP3" mask="0x00200000" name="LPDBCEN3" values="SUPC_WUMR__LPDBCEN3"/>
          <bitfield caption="Disable GPBR Clear Command from WKUP10/TMP1 pin" mask="0x01000000" name="DISTMPCLR1" values="SUPC_WUMR__DISTMPCLR1"/>
          <bitfield caption="Disable GPBR Clear Command from WKUP14/TMP2 Pin" mask="0x02000000" name="DISTMPCLR2" values="SUPC_WUMR__DISTMPCLR2"/>
          <bitfield caption="Disable GPBR Clear Command from WKUP15/TMP3 Pin" mask="0x04000000" name="DISTMPCLR3" values="SUPC_WUMR__DISTMPCLR3"/>
          <bitfield caption="Disable Timestamp from WKUP10/TMP1 Pin" mask="0x10000000" name="DISTSTMP1" values="SUPC_WUMR__DISTSTMP1"/>
          <bitfield caption="Disable Timestamp from WKUP14/TMP2 Pin" mask="0x20000000" name="DISTSTMP2" values="SUPC_WUMR__DISTSTMP2"/>
          <bitfield caption="Disable Timestamp from WKUP15/TMP3 Pin" mask="0x40000000" name="DISTSTMP3" values="SUPC_WUMR__DISTSTMP3"/>
        </register>
        <register caption="Supply Controller Wake-up Inputs Register" name="SUPC_WUIR" offset="0x10" rw="RW" size="4">
          <bitfield caption="WKUPx Input Enable" mask="0x00000001" name="WKUPEN0" values="SUPC_WUIR__WKUPEN0"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000002" name="WKUPEN1" values="SUPC_WUIR__WKUPEN1"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000004" name="WKUPEN2" values="SUPC_WUIR__WKUPEN2"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000008" name="WKUPEN3" values="SUPC_WUIR__WKUPEN3"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000010" name="WKUPEN4" values="SUPC_WUIR__WKUPEN4"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000020" name="WKUPEN5" values="SUPC_WUIR__WKUPEN5"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000040" name="WKUPEN6" values="SUPC_WUIR__WKUPEN6"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000080" name="WKUPEN7" values="SUPC_WUIR__WKUPEN7"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000100" name="WKUPEN8" values="SUPC_WUIR__WKUPEN8"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000200" name="WKUPEN9" values="SUPC_WUIR__WKUPEN9"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000400" name="WKUPEN10" values="SUPC_WUIR__WKUPEN10"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00000800" name="WKUPEN11" values="SUPC_WUIR__WKUPEN11"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00001000" name="WKUPEN12" values="SUPC_WUIR__WKUPEN12"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00002000" name="WKUPEN13" values="SUPC_WUIR__WKUPEN13"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00004000" name="WKUPEN14" values="SUPC_WUIR__WKUPEN14"/>
          <bitfield caption="WKUPx Input Enable" mask="0x00008000" name="WKUPEN15" values="SUPC_WUIR__WKUPEN15"/>
          <bitfield caption="WKUPx Input Type" mask="0x00010000" name="WKUPT0" values="SUPC_WUIR__WKUPT0"/>
          <bitfield caption="WKUPx Input Type" mask="0x00020000" name="WKUPT1" values="SUPC_WUIR__WKUPT1"/>
          <bitfield caption="WKUPx Input Type" mask="0x00040000" name="WKUPT2" values="SUPC_WUIR__WKUPT2"/>
          <bitfield caption="WKUPx Input Type" mask="0x00080000" name="WKUPT3" values="SUPC_WUIR__WKUPT3"/>
          <bitfield caption="WKUPx Input Type" mask="0x00100000" name="WKUPT4" values="SUPC_WUIR__WKUPT4"/>
          <bitfield caption="WKUPx Input Type" mask="0x00200000" name="WKUPT5" values="SUPC_WUIR__WKUPT5"/>
          <bitfield caption="WKUPx Input Type" mask="0x00400000" name="WKUPT6" values="SUPC_WUIR__WKUPT6"/>
          <bitfield caption="WKUPx Input Type" mask="0x00800000" name="WKUPT7" values="SUPC_WUIR__WKUPT7"/>
          <bitfield caption="WKUPx Input Type" mask="0x01000000" name="WKUPT8" values="SUPC_WUIR__WKUPT8"/>
          <bitfield caption="WKUPx Input Type" mask="0x02000000" name="WKUPT9" values="SUPC_WUIR__WKUPT9"/>
          <bitfield caption="WKUPx Input Type" mask="0x04000000" name="WKUPT10" values="SUPC_WUIR__WKUPT10"/>
          <bitfield caption="WKUPx Input Type" mask="0x08000000" name="WKUPT11" values="SUPC_WUIR__WKUPT11"/>
          <bitfield caption="WKUPx Input Type" mask="0x10000000" name="WKUPT12" values="SUPC_WUIR__WKUPT12"/>
          <bitfield caption="WKUPx Input Type" mask="0x20000000" name="WKUPT13" values="SUPC_WUIR__WKUPT13"/>
          <bitfield caption="WKUPx Input Type" mask="0x40000000" name="WKUPT14" values="SUPC_WUIR__WKUPT14"/>
          <bitfield caption="WKUPx Input Type" mask="0x80000000" name="WKUPT15" values="SUPC_WUIR__WKUPT15"/>
        </register>
